app/channels/application_cable/connection.rb

      def find_verified_user
        if verified_user = User.find_by(id: cookies.encrypted[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1