app/views/devise/registrations/new.html.erb

                                <%= f.label :'Fundacion' %><br />
                                <%= f.select :fundation_id, Fundation.all.collect{|p| [p.fundation_name, p.id]}, {:include_blank => "Seleccione"}, class: "form-control form-control-lg rounded-0" %>
---
SELECT `fundations`.* FROM `fundations`

                                <%= f.label :'Rol' %><br />
                                <%= f.select :role_id, Role.all.collect{|p| [p.description, p.id]}, {:include_blank => "Seleccione"}, class: "form-control form-control-lg rounded-0" %>
---
SELECT `roles`.* FROM `roles`

                                <%= f.label :'Estado' %><br />
                                <%= f.select :state_id, State.all.collect{|p| [p.description, p.id]}, {:include_blank => "Seleccione"}, class: "form-control form-control-lg rounded-0" %>
---
SELECT `states`.* FROM `states`