app/views/simple_discussion/forum_threads/_forum_thread.html.erb


        <p class="text-muted"><%= truncate(forum_thread.forum_posts.first.body, length: 200) %></p>
---
SELECT  `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`forum_thread_id` = 1 ORDER BY `forum_posts`.`id` ASC LIMIT 1