app/views/simple_discussion/forum_threads/show.html.erb


<%= render partial: "simple_discussion/forum_posts/forum_post", collection: @forum_thread.forum_posts.includes(:user).sorted %>
---
SELECT `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`forum_thread_id` = 1 ORDER BY `forum_posts`.`created_at` ASC