app/controllers/chat_rooms_controller.rb

SELECT `chat_rooms`.* FROM `chat_rooms`
---
  def index
    @chat_rooms = ChatRoom.all

INSERT INTO `chat_rooms` (`title`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 1, '2018-09-01 01:04:00', '2018-09-01 01:04:00')
---
  def create
    @chat_room = current_user.chat_rooms.build(chat_room_params)
    if @chat_room.save

SELECT  `chat_rooms`.* FROM `chat_rooms` WHERE `chat_rooms`.`id` = 2 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_room_id` = 2
---
  def show
    @chat_room = ChatRoom.includes(:messages).find_by(id: params[:id])