app/controllers/events_controller.rb

INSERT INTO `events` (`title`, `start_time`, `end_time`, `created_at`, `updated_at`) VALUES ('consulta', '2018-09-06 02:43:00', '2018-09-06 08:43:00', '2018-09-05 02:44:20', '2018-09-05 02:44:20')
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save