app/controllers/login_controller.rb

	def index
		@user = User.all
---
SELECT `users`.* FROM `users`

	def create
		#render plain: params[:login].inspect
		@user = User.new login_params
		@user.save
---
INSERT INTO `users` (`name`, `lastname`, `password`, `document`, `mail`, `phone`, `profession`, `id_fundation`, `role`, `state`, `created_at`, `updated_at`) VALUES ('Juan  Sebastian', 'Calderon Rios', '1234', 101843354, 'sbas23@gmail.com', 312432773, 'Desarrollador', 1, '1', 1, '2018-08-15 18:06:11', '2018-08-15 18:06:11')

	def show
		@user = User.find params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1