app/models/conversation.rb

  def self.get(sender_id, recipient_id)
    conversation = between(sender_id, recipient_id).first
    return conversation if conversation.present?
---
SELECT  `conversations`.* FROM `conversations` WHERE (`conversations`.`sender_id` IS NULL AND `conversations`.`recipient_id` = 1 OR `conversations`.`sender_id` = 1 AND `conversations`.`recipient_id` IS NULL) ORDER BY `conversations`.`id` ASC LIMIT 1
SELECT  1 AS one FROM `conversations` WHERE `conversations`.`sender_id` IS NULL AND `conversations`.`recipient_id` = 1 LIMIT 1